#include <stdio.h>


int main() {
    printf("Hello World!\n");
    printf("|%11.6f|\n", 123.23); //
    printf("|%-11.6f|\n", 123.23);
    printf("|%11.6s|\n", "Привіт всім!");
    printf("|%-11.6s|\n", "Привіт всім!");

    printf("\n-------------------------------------------\n");

    printf("Блок 1\n");
    printf("Завдання 1\n");
    printf("|%d|\n", 42); // Виведе |42|, d вказує на ціле десяткове число зі знаком
    printf("|%5d|\n", 42); // Виведе |   42| бо 5 вказує на вивід не менше 5 символів і по стандарту вирівнювання йде по правій стороні
    printf("|%-5d|\n", 42); // Виведе |42   | бо 5 вказує на вивід 5 символів, а знак "-" міняє вирівнювання по лівій стороні

    printf("Завдання 2\n");
    printf("|%f|\n", 3.14); // Чого вивело 3.140000? - %f за замовчуванням виводить 6 знаків після коми
    printf("|%.2f|\n", 3.14); // |3.14| бо ми вказали вивести 2 знаки після коми
    printf("|%6.2f|\n", 3.14); // |  3.14| бо ми вказали вивести 6 знаків і 2 після коми

    printf("Блок 2 C-strings\n");
    printf("Завдання 3\n");
    printf("|%s|\n", "hello"); // Виведе hello бо s вказує на стрічковий літерал
    printf("|%3s|\n", "hello"); // Виводить hello,бо 3s вказує на мінімальну ширину рядка
    printf("|%.3s|\n", "hello"); // тут ми виводимо hel бо вказали, що виведемо 3 байти, а латина займає 1 байт на літеру
    printf("|%5.3s|\n", "hello"); // по ідеї має вивести |  hel| бо ми вказали що ширина має складати не менше 5 символів, але вивести всього 3 байти

    printf("Завдання 4\n");
    char s[] = "abc";
    printf("|%s|\n", s); // Виведе abc
    printf("|%5s|\n", s); // Виведе abc але прижату до правої сторони бо ми вказали вивести рядок шириною 5 символів і перші два будуть пусті
    printf("|%-5s|\n", s); // Виведе abc але вирівняє по лівій стороні
    printf("|%.2s|\n", s); // Виведе ab бо ми вказали вивести 2 байти

    printf("Блок 3 — числа + рядки разом\n");
    printf("Завдання 5\n");
    printf("|%5d|%5d|\n", 1, 123); // Виведе 1 прижату в право, і 123 теж
    printf("|%-5d|%-5d|\n", 1, 123); // Виведе рядки шириною 5 знаків і числа прижаті вліво бо знак мінус вказує на вирвнювання по лівому краю
    printf("|%5d|%-5d|\n", 1, 123); // 1 вирівняє по праву стороно і 123 по ліву

    printf("Блок 4 — кирилиця\n"); // (ДУЖЕ ВАЖЛИВО!)
    printf("Завдання 6\n");
    printf("|%s|\n", "Привіт"); // Виведе Привіт 
    printf("|%.4s|\n", "Привіт"); // Виведе Пр - бо ми вказали вивести 4 байти, в кирилиці один символ 2 байти
    printf("|%.5s|\n", "Привіт"); // Виведе Пр, а далі не зрозуміло, бо в 5 байтів третій знак не влізе
    printf("|%.6s|\n", "Привіт"); // Виведе При

    printf("Завдання 7\n"); 
    printf("|%8.3f|\n", 12.34567); // Тут ми вказали вивести число шириною 8 знаків і 3 знаки після коми тому виведе 12.345 при чому перші два знаки будуть пробіли
    printf("|%-8.3f|\n", 12.34567); // Тут виведе так як у попередньому варіанті, але вирівняє по лівому краю

    printf("Завдання 8\n");
    printf("|%10s|\n", "hi"); // Виведе hi вирівняне по правому краю бо рядок шириною 10 символів
    printf("|%-10s|\n", "hi"); // Як попереднє, але вирівняє по лівому краю
    printf("|%10.1s|\n", "hi"); // Виведе h вирівняне по правому краю

    return 0;
}